Revit 2024 API
AnalyticalLink.StartHubId Property
 Hub ID at start of AnalyticalLink.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId StartHubId { get; }
Visual Basic
Public ReadOnly Property StartHubId As ElementId
	Get
Visual C++
public:
property ElementId^ StartHubId {
	ElementId^ get ();
}
See Also
AnalyticalLink Class
Autodesk.Revit.DB.Structure Namespace